---
kind: property
id: P:Autodesk.Revit.DB.TextNode.Width
zh: 宽度
source: html/316de334-7918-b4d5-d3e9-f0e980078c7b.htm
---
# Autodesk.Revit.DB.TextNode.Width Property

**中文**: 宽度

Width [ft] of the area of the text content in model space.

## Syntax (C#)
```csharp
public double Width { get; }
```

## Remarks
Specifies the actual width of the text, that is essentially the width of the longest line, including any spaces.
 The value represents the width after the width scale has been applied.